Config/Catalogs/ScanConfigurations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ScanConfigurations</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ScanConfigurationName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IdentityDocumentType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentityDocumentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaperSize</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PaperSizes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorDepth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ColorDepths</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsVisa</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsMigrationCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsFanID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RecognitionIsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForeigner</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LanguageID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ExternalNames</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ExternalName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ImageScannerDrivers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ImageScannerDrivers</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AbbyyPassportReaderSDKEngine</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ContentAIPassportReaderSDKEngine</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CognitiveScanifyAPI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SmartPassportBoxEngine</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Scan1C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Regula</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SmartPassportBoxEngineREST</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ScanConfigurations/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
	vWstn = SessionParameters.CurrentWorkstation;
	If ValueIsFilled(vWstn.ImagesScannerConnectionParameters) Then
		ImageScannerDriver = vWstn.ImagesScannerConnectionParameters.ImageScannerDriver;
		If ImageScannerDriver = Enums.ImageScannerDrivers.SmartPassportBoxEngine Then
			Items.ScanConfigurationName.Enabled = False;
			Items.ColorDepth.Enabled = False;
			Items.Rotation.Enabled = False;
			Items.PaperSize.Enabled = False;
			Items.LanguageID.Enabled = False;
			Items.ExternalNames.Enabled = False;
		ElsIf ImageScannerDriver = Enums.ImageScannerDrivers.Regula Then
			Items.ScanConfigurationName.Enabled = False;
			Items.ColorDepth.Enabled = False;
			Items.Rotation.Enabled = False;
			Items.PaperSize.Enabled = False;
		Else
			Items.LanguageID.Enabled = False;
			Items.ExternalNames.Enabled = False;
		EndIf;
	EndIf;
	If Not IsBlankString(Object.ScanConfigurationName) Then
	    Items.ScanConfigurationName.ChoiceList.Add(Object.ScanConfigurationName,Object.ScanConfigurationName);
	EndIf; 
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure ScanConfigurationNameStartChoice(Item, ChoiceData, StandardProcessing)
	vMsg = "";
	If amImageScanner = Undefined Then
		// Connection images scaner
		vModuleName = tcDevicesConnection.cmGetImagesScannerDriverModule(vMsg);
		If Not IsBlankString(vMsg) Then
			ShowMessageBox(,vMsg);
			Return;
		Else
			If Not vModuleName = Undefined Then
				amImageScanner  = tcCommonFunctions.cmGetCommonModule(vModuleName);;
			EndIf; 
		EndIf; 
	EndIf;
	If amImageScanner = Undefined Then
		ShowMessageBox(, NStr("en = 'Could not connect to image scanner!'; de = 'Verbindung zum Bildscanner konnte nicht hergestellt werden!'; ru = 'Не удалось подключиться к сканеру изображений!'"));
		Return;
	EndIf;

	rMessage = "";
	vList = amImageScanner.pmGetListOfAllowedConfigurations(rMessage);
	If Not IsBlankString(rMessage) Then
		ShowMessageBox(,rMessage);
		Return;
	Else
		Items.ScanConfigurationName.ChoiceList.Clear();
		For Each vIS In vList Do
		  Items.ScanConfigurationName.ChoiceList.Add(vIS.Value, vIS.Value);
		EndDo; 
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IdentityDocumentTypeOnChange(Item)
	If ValueIsFilled(Object.IdentityDocumentType) And IsBlankString(Object.Description) Then
		Object.Description = Object.IdentityDocumentType;
	EndIf;	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure Edit(pCommand)
	vDocumentTypeList = GetDocumentTypeList();
	If vDocumentTypeList.Count() > 0 Then
		vNotifyDescription = New NotifyDescription("AfterExternalNamesEdit", ThisObject);
		vParams = New Structure("ValueList, MultipleChoice, Title", vDocumentTypeList, True, NStr("en = 'Choose document types'; de = 'Dokumenttypen auswählen'; ru = 'Отметьте типы документов'"));
		OpenForm("CommonForm.mcChoiceValueList", vParams, ThisObject, UUID, , , vNotifyDescription); 	
	EndIF;
EndProcedure // Edit

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Function GetDocumentTypeList()
	vResult = New ValueList();
	
	vDocumentTypeList = Catalogs.ScanConfigurations.GetTemplate("RegulaDocumentType");

	For i = 2 To vDocumentTypeList.TableHeight Do
		Try
			vResult.Add(TrimAll(vDocumentTypeList.Area(i, 2, i, 2).Text), TrimAll(vDocumentTypeList.Area(i, 1, i, 1).Text) + " (" + vDocumentTypeList.Area(i, 2, i, 2).Text + ")", Object.ExternalNames.FindRows(New Structure("ExternalName", TrimAll(vDocumentTypeList.Area(i, 2, i, 2).Text))).Count() > 0); 	
		Except
		EndTry;
	EndDo;
	
	Return vResult;
EndFunction // GetDocumentTypeList

// -----------------------------------------------------------------------------
&AtClient
Procedure AfterExternalNamesEdit(pValueList, pExtraParams) Export
	If pValueList = Undefined Then
		Return;
	EndIf;
	
	Object.ExternalNames.Clear();
	For Each vItem In pValueList Do
		If Not vItem.Check Then
			Continue;
		EndIf;
		
		vNewRow = Object.ExternalNames.Add();
		vNewRow.ExternalName = vItem.Value;
	EndDo;
	
	Modified = True;
EndProcedure // AfterExternalNamesEdit

#EndRegion
